public/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-26 Mon 08:40 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>greenpaint</title>
<meta name="author" content="Andy Han" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">greenpaint</h1>
<p>
<a href="https://www.github.com/andyqhan/greenpaint">greenpaint</a> is an in-browser crossword solver, written in vue.js. It&rsquo;s easy to integrate into your own website.
</p>

<p>
Try the <a href="demo_puzzle.html">demo puzzle</a> or an instance of greenpaint where you can <a href="custom_puzzle.html">upload your own puzzle</a>. 
</p>

<div id="outline-container-org90a440f" class="outline-2">
<h2 id="org90a440f">Features</h2>
<div class="outline-text-2" id="text-org90a440f">
<ul class="org-ul">
<li>Customizable keybinds</li>
<li>37 built-in themes (courtesy of <a href="https://github.com/hlissner/emacs-doom-themes">emacs-doom-themes</a>)</li>
<li>All the basic crossword features (checking square/word/grid, clearing, revealing square/word/grid, stopwatch, rebus, etc)</li>
<li>JSON or puz input</li>
</ul>
</div>
</div>
<div id="outline-container-orga960ff3" class="outline-2">
<h2 id="orga960ff3">Installation and setup</h2>
<div class="outline-text-2" id="text-orga960ff3">
</div>
<div id="outline-container-org7ed4338" class="outline-3">
<h3 id="org7ed4338">Installing greenpaint</h3>
<div class="outline-text-3" id="text-org7ed4338">
<ol class="org-ol">
<li>Download the latest build from the <a href="https://github.com/andyqhan/greenpaint/releases">Releases</a> page</li>
<li><p>
Add the following HTML to your website:
</p>
<div class="org-src-container">
<pre class="src src-html"><span style="color: #64727d; font-style: italic;">&lt;!-- </span><span style="color: #64727d; font-style: italic;">import vue </span><span style="color: #64727d; font-style: italic;">--&gt;</span>
&lt;<span style="color: #F9B5AC;">script</span> <span style="color: #c6797e;">src</span>=<span style="color: #A3B09A;">"https://unpkg.com/vue@3.0.5"</span>&gt;&lt;/<span style="color: #F9B5AC;">script</span>&gt;
<span style="color: #64727d; font-style: italic;">&lt;!-- </span><span style="color: #64727d; font-style: italic;">see "loading your puzzles" for how to get the json </span><span style="color: #64727d; font-style: italic;">--&gt;</span>
&lt;<span style="color: #F9B5AC;">script</span> <span style="color: #c6797e;">id</span>=<span style="color: #A3B09A;">"puzzlepath"</span>&gt;"path/to/json/or/puz"&lt;/<span style="color: #F9B5AC;">script</span>&gt;
<span style="color: #64727d; font-style: italic;">&lt;!-- </span><span style="color: #64727d; font-style: italic;">these are the files you get from releases </span><span style="color: #64727d; font-style: italic;">--&gt;</span>
&lt;<span style="color: #F9B5AC;">script</span> <span style="color: #c6797e;">type</span>=<span style="color: #A3B09A;">"text/javascript"</span> <span style="color: #c6797e;">src</span>=<span style="color: #A3B09A;">"/path/to/chunk-vendors.js"</span>&gt;&lt;/<span style="color: #F9B5AC;">script</span>&gt;
&lt;<span style="color: #F9B5AC;">script</span> <span style="color: #c6797e;">type</span>=<span style="color: #A3B09A;">"text/javascript"</span> <span style="color: #c6797e;">src</span>=<span style="color: #A3B09A;">"/path/to/app.js"</span>&gt;&lt;/<span style="color: #F9B5AC;">script</span>&gt;
<span style="color: #64727d; font-style: italic;">&lt;!-- </span><span style="color: #64727d; font-style: italic;">finally, load the app </span><span style="color: #64727d; font-style: italic;">--&gt;</span>
&lt;<span style="color: #F9B5AC;">div</span> <span style="color: #c6797e;">id</span>=<span style="color: #A3B09A;">"app"</span>&gt;&lt;/<span style="color: #F9B5AC;">div</span>&gt;
</pre>
</div></li>
</ol>
<p>
You can stop at this point if you don&rsquo;t want to specify a puzzle to play. If greenpaint can&rsquo;t find a valid JSON or puz file, it loads in <a href="custom_puzzle.html">&ldquo;upload&rdquo; mode</a>, which means that the user can upload their own puzzle to play. 
</p>
</div>
</div>
<div id="outline-container-org0732938" class="outline-3">
<h3 id="org0732938">Using puz files</h3>
<div class="outline-text-3" id="text-org0732938">
<p>
greenpaint can read puzzle data from puz binaries. I have implemented puz parsing with the help of the source code from AcrossLiteToText and <a href="https://github.com/keiranking/Phil">Phil</a>. If you want to use a puz, simply put its path where the code snippet says <code>"path/to/json/or/puz"</code>. Users can also upload their own puz files in upload mode.
</p>

<p>
The puz parser has not been rigorously tested. If your puzzle doesn&rsquo;t work, especially if it contains rebuses or circles or other fancy things, try the JSON method.
</p>
</div>
</div>
<div id="outline-container-orgabbc54f" class="outline-3">
<h3 id="orgabbc54f">Using JSON files</h3>
<div class="outline-text-3" id="text-orgabbc54f">
<p>
greenpaint can read puzzle data from the JSONs produced by <a href="https://github.com/jahorne/AcrossLiteToText">AcrossLiteToText</a>. First, download the latest release of AcrossLiteToText and unzip it. 
</p>

<p>
Converting a single .puz on Mac:
</p>
<ol class="org-ol">
<li>Install <a href="https://brew.sh/">Homebrew</a> if you don&rsquo;t have it</li>
<li>Run <code>brew install dotnet</code> in Terminal</li>
<li>Type <code>cd</code> in Terminal, then a space, then drag and drop the AcrossLiteToText folder you downloaded</li>
<li>Run <code>dotnet AcrossLiteToText.dll [from] [to] [filename]</code>. All three seem to be required for JSON export. <code>[from]</code> is the path to your .puz file, <code>[to]</code> is the location where you want your JSON file to go, and <code>[filename]</code> is what  you want the converted file to be named. The instructions for AcrossLiteToText claim that <code>[to]</code> and <code>[filename]</code>  are optional, but it seems to be required for JSON export. So, for example, if I have a file called <code>puzzle.puz</code> in the same directory as my <code>AcrossLiteToText.dll</code>, and I want to save the JSON in the same directory, and I want the JSON to be called <code>puzzle.json</code>, I run the following command: <code>dotnet AcrossLiteToText.dll puzzle.puz . puzzle</code>. The period in the middle means &ldquo;the current directory&rdquo;.</li>
<li>Delete the vestigial .txt and .xml files</li>
</ol>

<p>
This is annoying if you have a whole folder of puz files you want to convert. I wrote a <a href="https://gist.github.com/andyqhan/b0c1d72cd479fe16fb0f96ee4b680a28">script</a> to convert a whole folder to JSON automatically. To use it (on Mac or Linux):
</p>
<ol class="org-ol">
<li>Download the script</li>
<li>Move it to the same folder as your <code>AcrossLiteToText.dll</code></li>
<li>In the Terminal, navigate to that folder (<code>cd /path/to/your/acrosslitetotext/folder</code>)</li>
<li>In the Terminal, run <code>chmod +x convertjson.sh</code></li>
<li>In the Terminal, run <code>zsh convertjson.sh [from] [to]</code></li>
</ol>
<p>
<code>[from]</code> is the folder containing your puz files. <code>[to]</code> is the folder where you want the JSONs to go. 
</p>
</div>
</div>
<div id="outline-container-org41f14b9" class="outline-3">
<h3 id="org41f14b9">Loading your puzzles in greenpaint</h3>
<div class="outline-text-3" id="text-org41f14b9">
<p>
Now that you have a puzzle (either puz or JSON), all you need to do is let greenpaint find it. greenpaint looks for an element with the <code>"puzzlepath"</code> id, and looks at the body of the element to read where the file is.
</p>
<ol class="org-ol">
<li>Upload the file to your server in whatever way your setup requires.</li>
<li><p>
Add the element to the page you&rsquo;re loading greenpaint in (I use <code>script</code> tags): 
</p>
<div class="org-src-container">
<pre class="src src-html">&#8230;
&lt;<span style="color: #F9B5AC;">script</span> <span style="color: #c6797e;">id</span>=<span style="color: #A3B09A;">"puzzlepath"</span>&gt;"path/to/json/or/puz"&lt;/<span style="color: #F9B5AC;">script</span>&gt;
&#8230;
</pre>
</div>
<p>
Note that the path must be enclosed in quotes (otherwise, Javascript thinks it&rsquo;s a regular expression). I recommend using an absolute path (like <code>"https://yourwebsite.com/path/to/json"</code>), since then you avoid the headaches endemic to relative paths in websites.
</p></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org494fdb4" class="outline-2">
<h2 id="org494fdb4">Usage</h2>
<div class="outline-text-2" id="text-org494fdb4">
</div>
<div id="outline-container-org3dd0ea1" class="outline-3">
<h3 id="org3dd0ea1">Setting keybinds</h3>
<div class="outline-text-3" id="text-org3dd0ea1">
<p>
My primary motivation for making greenpaint was so that I could have my own keybindings for grid movement. So, greenpaint allows you to define custom keybinds. Here&rsquo;s a table of the default bindings:
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Intuitive bind</th>
<th scope="col" class="org-left">Emacs-inspired bind</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">move right by square</td>
<td class="org-left"><code>ArrowRight</code></td>
<td class="org-left"><code>Ctrl-f</code></td>
</tr>

<tr>
<td class="org-left">move left by square</td>
<td class="org-left"><code>ArrowLeft</code></td>
<td class="org-left"><code>Ctrl-b</code></td>
</tr>

<tr>
<td class="org-left">move up by square</td>
<td class="org-left"><code>ArrowUp</code></td>
<td class="org-left"><code>Ctrl-p</code></td>
</tr>

<tr>
<td class="org-left">move down by square</td>
<td class="org-left"><code>ArrowDown</code></td>
<td class="org-left"><code>Ctrl-n</code></td>
</tr>

<tr>
<td class="org-left">delete square</td>
<td class="org-left"><code>Backspace</code></td>
<td class="org-left"><code>Ctrl-d</code></td>
</tr>

<tr>
<td class="org-left">move right by word</td>
<td class="org-left"><code>Tab</code>, <code>Enter</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">move left by word</td>
<td class="org-left"><code>Shift-Tab</code>, <code>Shift-Enter</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">move to start of word</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Ctrl-a</code></td>
</tr>

<tr>
<td class="org-left">move to end of word</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Ctrl-e</code></td>
</tr>

<tr>
<td class="org-left">delete rest of word</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>Ctrl-k</code></td>
</tr>

<tr>
<td class="org-left">switch direction</td>
<td class="org-left"><code>Space</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
You can change the keybinds by going to the Settings tab. Click on a keybind to delete it, or enter a new one in the box to add it. 
</p>

<p>
You can bind the following keys by themselves: <code>Tab</code>, <code>Space</code>, <code>Backspace</code>, <code>ArrowRight</code>, <code>ArrowLeft</code>, <code>ArrowUp</code>, <code>ArrowDown</code>, and <code>Enter</code>. Additionally, you can prepend <code>Ctrl-</code> or <code>Shift-</code> to any of that list, as well as an alphanumeric (but you can&rsquo;t bind a letter by itself; sorry vimmers). You can bind multiple keys at a time by separating them with a comma (with no space), like this: <code>ArrowRight,Ctrl-f</code>.
</p>

<p>
Hit enter to add the bind, and click apply to apply it.
</p>
</div>
</div>
<div id="outline-container-orgd2cb34c" class="outline-3">
<h3 id="orgd2cb34c">Changing themes</h3>
<div class="outline-text-3" id="text-orgd2cb34c">
<p>
My other motivation was having dark themes. You can change to any of the 37 themes included in greenpaint. These themes are from the <a href="https://github.com/hlissner/emacs-doom-themes">emacs-doom-themes</a> project (MIT), maintained by the nonpareil Henrik Lissner. Caveat emptor: with some dark themes, it&rsquo;s hard to read the letter under point.
</p>

<p>
Some dark themes that work particularly well are: oceanic next, ephemeral (defualt), dracula, challenger dark, and fairy floss. 
</p>
</div>
</div>
</div>
<div id="outline-container-org13a7e64" class="outline-2">
<h2 id="org13a7e64">Limitations and bugs</h2>
<div class="outline-text-2" id="text-org13a7e64">
<ul class="org-ul">
<li>Rebuses are weird. Hit enter after inputting a rebus instead of clicking the rebus button</li>
<li>It&rsquo;s not <a href="https://en.wikipedia.org/wiki/Responsive_web_design">responsive</a>, so Sundays might be a little hard to read</li>
<li>Doesn&rsquo;t work on mobile</li>
</ul>
</div>
</div>
<div id="outline-container-orga130522" class="outline-2">
<h2 id="orga130522">Licensing 🥱</h2>
<div class="outline-text-2" id="text-orga130522">
<p>
greenpaint is released under the <a href="https://mit-license.org/">MIT License</a>. Use it for whatever you want.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Andy Han</p>
<p class="date">Created: 2021-04-26 Mon 08:40</p>
</div>
</body>
</html>
